; domain
;Header and description

(define (domain clean-robot)

;import needed requirements
(:requirements :strips :negative-preconditions :typing)

;define types box and robot just for simplicity
(:types box - movable robot - movable office)

; There is always only one robot so it can be 
; defined as a constant
(:constants R - robot)

(:predicates
 (at ?B - movable ?o - office) ; The object B is at office o
 (adj ?o1 ?o2 - office) ; The offices o1 and o2 are adjacent
 (dirty ?o - office) ; The office o is dirty
 (empty ?o - office) ; There is no box at office o
)

(:action clean
    :parameters (?o - office)
    :precondition (and (at R ?o) ; The robot is at office o
                       (dirty ?o) ; The office o is dirty
                    )
    :effect (and (not (dirty ?o)) ; The office o is not dirty anymore
            )
)

(:action move
    :parameters (?o1 ?o2 - office)
    :precondition (and (adj ?o1 ?o2) ; Both offices are adjacent
                        (at R ?o1) ; The robot is at office o1
                   )
    :effect (and (not (at R ?o1)) ; The robot is not at office o1 anymore
                 (at R ?o2) ; The robot is now at office o2
            )
)

(:action push
    :parameters (?B - box ?o1 ?o2 - office)
    :precondition (and (at R ?o1) ; The robot is at office o1
                       (adj ?o1 ?o2) ; Both offices are adjacent
                       (at ?B ?o1) (empty ?o2) ; The box B is at o1 and o2 is empty
                   )
    :effect (and (at R ?o2) (not (at R ?o1)) ; Move the robot to o2
                 (at ?B ?o2) (not (at ?B ?o1)) ; Move the box to o2
                 (not (empty ?o2)) (empty ?o1) ; o2 is not empty anymore and o1 is empty
            )
)



;define actions here

)

; problem
(define (problem NBOX0) (:domain clean-robot)
(:objects
    o1 o2 o3 o4 o5 o6 o7 o8 o9 - office ; Offices
)

(:init

 ; Adjacency conditions
 (adj o1 o2) (adj o2 o1)
 (adj o1 o4) (adj o4 o1)

 (adj o2 o5) (adj o5 o2)
 (adj o2 o3) (adj o3 o2)

 (adj o3 o6) (adj o6 o3)
 (adj o4 o5) (adj o5 o4)

 (adj o4 o7) (adj o7 o4)
 (adj o5 o6) (adj o6 o5)

 (adj o5 o8) (adj o8 o5)
 (adj o6 o9) (adj o9 o6)

 (adj o7 o8) (adj o8 o7)
 (adj o8 o9) (adj o9 o8)
 
 ; Robot initial location
 (at R o7)

 ; Dirty offices
 (dirty o3)
 (dirty o4)

)

(:goal (and
    ; Robot final location
    (at R o4)

    ; Clean offices
    (not (dirty o3))
    (not (dirty o4))
))
)

; plan
1. (move o7 o4)
   deleted: (at r o7)
   added: (at r o4)
   goals met: 1 of 3
2. (clean o4)
   deleted: (dirty o4)
   goals met: 2 of 3
3. (move o4 o1)
   deleted: (at r o4)
   added: (at r o1)
   goals met: 1 of 3
4. (move o1 o2)
   deleted: (at r o1)
   added: (at r o2)
   goals met: 1 of 3
5. (move o2 o3)
   deleted: (at r o2)
   added: (at r o3)
   goals met: 1 of 3
6. (clean o3)
   deleted: (dirty o3)
   goals met: 2 of 3
7. (move o3 o2)
   deleted: (at r o3)
   added: (at r o2)
   goals met: 2 of 3
8. (move o2 o1)
   deleted: (at r o2)
   added: (at r o1)
   goals met: 2 of 3
9. (move o1 o4)
   deleted: (at r o1)
   added: (at r o4)
   goals met: 3 of 3
